[
  {
    "q": "The three concentric layers (tunics) found in most blood vessels are:",
    "options": [
      "Endocardium, Myocardium, Epicardium",
      "Tunica Interna, Tunica Media, Tunica Externa",
      "Tunica Intima, Tunica Media, Tunica Adventitia",
      "Adventitia, Intima, Endothelium"
    ],
    "answer": "Tunica Intima, Tunica Media, Tunica Adventitia",
    "explanation": "Most vessels share three tunics: intima (inner), media (middle), and adventitia (outer). The heart wall layers are a different scheme."
  },
  {
    "q": "Which layer of a blood vessel is primarily composed of simple squamous endothelium and a basal lamina, and is separated from the middle layer by the internal elastic membrane?",
    "options": [
      "Tunica Media",
      "Tunica Externa (Adventitia)",
      "Tunica Intima",
      "Subendothelial Layer"
    ],
    "answer": "Tunica Intima",
    "explanation": "The tunica intima includes endothelium and basal lamina; an internal elastic membrane often demarcates it from the media."
  },
  {
    "q": "A patient presents with a severe hemorrhage following trauma. Which characteristic of the venous system helps the body temporarily manage blood loss and maintain central pressure?",
    "options": [
      "The presence of numerous valves to prevent backflow.",
      "The prominent tunica externa that resists physical wall strain.",
      "The venous system serves as a blood reservoir, containing approximately 70% of total blood volume.",
      "The thick tunica media allowing for powerful vasoconstriction."
    ],
    "answer": "The venous system serves as a blood reservoir, containing approximately 70% of total blood volume.",
    "explanation": "Veins act as capacitance vessels and hold most of the blood volume, allowing redistribution when needed."
  },
  {
    "q": "Which type of capillary is characterized by circular fenestrations (pores) penetrating the endothelium, enabling rapid exchange of water and small solutes, as seen in the kidney glomeruli?",
    "options": [
      "Continuous Capillaries",
      "Discontinuous Capillaries (Sinusoids)",
      "Muscular Capillaries",
      "Fenestrated Capillaries"
    ],
    "answer": "Fenestrated Capillaries",
    "explanation": "Fenestrations permit rapid molecular exchange; they are abundant in renal glomeruli and endocrine tissues."
  },
  {
    "q": "Which of the following is NOT a characteristic of veins compared to arteries?",
    "options": [
      "Thinner walls relative to lumen diameter",
      "Operate under much lower pressure",
      "Prominent tunica media",
      "Serve as a blood reservoir (capacitance vessels)"
    ],
    "answer": "Prominent tunica media",
    "explanation": "Arterial media is typically thicker; veins have thinner walls and larger lumens at lower pressure."
  },
  {
    "q": "The primary pacemaker of the heart is the:",
    "options": [
      "Atrioventricular (AV) Node",
      "Bundle of His",
      "Purkinje Fibers",
      "Sinoatrial (SA) Node"
    ],
    "answer": "Sinoatrial (SA) Node",
    "explanation": "The SA node normally initiates the heartbeat and sets the pace."
  },
  {
    "q": "A pathologist observes a blood vessel with a very thick tunica media (thicker than the lumen) and prominent elastic membranes. Which vessel primarily controls peripheral resistance?",
    "options": [
      "A large vein",
      "An elastic artery",
      "A muscular artery (or arteriole)",
      "A capillary"
    ],
    "answer": "A muscular artery (or arteriole)",
    "explanation": "Muscular arteries/arterioles regulate diameter and thus resistance and blood pressure."
  },
  {
    "q": "The layers of the heart wall, from innermost to outermost, are:",
    "options": [
      "Epicardium, Myocardium, Endocardium",
      "Endocardium, Myocardium, Epicardium",
      "Tunica Intima, Tunica Media, Tunica Externa",
      "Myocardium, Epicardium, Endocardium"
    ],
    "answer": "Endocardium, Myocardium, Epicardium",
    "explanation": "Endocardium lines chambers, myocardium is muscle, epicardium is the visceral pericardium."
  },
  {
    "q": "What is the histological correlate of the blood-brain barrier enabling highly selective permeability in the CNS?",
    "options": [
      "Discontinuous capillaries with large gaps",
      "Fenestrated capillaries with pores",
      "Continuous capillaries with uninterrupted endothelium and tight junctions",
      "Postcapillary venules with no smooth muscle"
    ],
    "answer": "Continuous capillaries with uninterrupted endothelium and tight junctions",
    "explanation": "Continuous endothelium with tight junctions restricts paracellular movement—key to the BBB."
  },
  {
    "q": "What specialized function is performed by the Atrioventricular (AV) Node in the cardiac conduction system?",
    "options": [
      "Rapidly distributing impulses throughout the ventricles",
      "Spontaneously generating impulses at 60–100 bpm",
      "Dividing into right and left bundle branches",
      "Delaying impulse transmission to allow for ventricular filling"
    ],
    "answer": "Delaying impulse transmission to allow for ventricular filling",
    "explanation": "The AV nodal delay ensures atrial contraction completes before ventricular systole."
  },
  {
    "q": "In severe liver disease, which capillary type—normally allowing exchange of large molecules and cells—is disrupted?",
    "options": [
      "Continuous capillaries",
      "Fenestrated capillaries",
      "Discontinuous capillaries (sinusoids)",
      "Postcapillary venules"
    ],
    "answer": "Discontinuous capillaries (sinusoids)",
    "explanation": "Hepatic sinusoids have wide gaps and incomplete basement membrane to support exchange."
  },
  {
    "q": "During acute inflammation, which vessels are the primary sites for leukocyte emigration into tissues?",
    "options": [
      "Elastic arteries",
      "Large veins",
      "Capillaries",
      "Postcapillary venules"
    ],
    "answer": "Postcapillary venules",
    "explanation": "Postcapillary venules facilitate diapedesis during immune responses."
  },
  {
    "q": "Opening arteriovenous anastomoses in the skin of extremities most immediately supports which function?",
    "options": [
      "Maintaining consistent blood pressure",
      "Minimizing heat loss (conservation)",
      "Maximizing heat release (dissipation)",
      "Ensuring perfusion through the capillary bed"
    ],
    "answer": "Maximizing heat release (dissipation)",
    "explanation": "Shunting blood to the skin surface enhances heat loss for thermoregulation."
  },
  {
    "q": "A defect in which cardiac structure would most directly impair the coordinated sequence of atrial then ventricular contraction?",
    "options": [
      "Cardiac fibrous skeleton",
      "Myocardium",
      "Valve spongiosa",
      "Vasa vasorum"
    ],
    "answer": "Cardiac fibrous skeleton",
    "explanation": "The fibrous skeleton electrically insulates atria from ventricles, routing impulses via the AV bundle."
  }
]